[Main]
Abort=Abort
About=About
ActivationServer=Activation server
ActivationServerNotSpecified=Activation server not specified
Add=Add
Address=Address
AddressNotFound=Address "%.8x" not found
AddressUsedByProcedure=Address is used by procedure "%s"
AddWatermark=New watermark
Age=Age
Algorithm=Key Pair Algorithm
All=All
AllFiles=All files
AllProcedures=All procedures
ApplicationIsNotAllowedToRun=Application is not allowed to run
AutoSaveProject=Autosave project after compilation
Back=Back
Best=Best (slow unpacking)
Block=Block Serial Number
BreakAddress=End of procedure
Calculate=Calculate
Calculator=Calculator
Calls=Calls of procedures
Cancel=Cancel
CheckAtr=Check ATR
ClearHistory=Clear history
Close=Close
CloseFolders=Collapse all folders
CodeSectionNotFound=Section "CODE" not found
CommandNotSupport=Command not supported
Commands=Commands
CommandsWithConditions=Commands with internal conditions
Comments=Comments
CompilationType=Compilation type
CompilationTypeHelp=The correct choice of <a href="expert_procedures.htm#CompilationTypes">the protection method</a> against analyzing and cracking each protected object (procedure, function, code section) will ensure the optimal proportion between the protection level and the execution performance.
Compile=Compilation
Compiled=Compilation complete
CompilerMessages=Compiler messages
ConditionalJumps=Conditional jumps
ContainsProtectedCode=contains protected code
Confirm=Confirm
Contents=Contents
Continue=Continue
Copy=Copy
CopySerialNumber=Copy Serial Number
Count=Count
CPU=CPU
CreateFileError=Cannot create file "%s"
CreateUserKey=Create user dongle
CryptValues=Hide constants
CryptValuesHelp=If this option is enabled, it will be impossible to find the addresses of variables or the addresses of called functions in the bytecode in the open form.
CustomerName=Customer Name
Cut=Cut
Date=Date
Debug=Debug mode (search of external addresses)
DebugHelp=When the "Debug mode" option is enabled, the INT 03 instruction will take the place of the original code. It is a regular breakpoint and a service instruction when the program is running in the debugger.
Debugger=Debugger
DebuggerHelp=This option prevents the debugging of the protected file. There are 2 types of debuggers: user-mode (OllyDBG, WinDBG, etc) and kernel-mode (SoftICE, Syser, etc).
DebuggerFound=Debugger found
DecreaseIsSpeed=decrease in speed
Del=Delete
DelDLL=Delete DLL
Delete=Delete
Deleting=Deleting
DelFolder=Delete folder
DelLicense=Delete license
DelProcedure=Delete procedure
DelWatermark=Delete watermark
Demo=Demo version
DemoLimit=In unregistered version it is possible to protect only one procedure
Detection=Detection
DeveloperPIN=Developer PIN
DeveloperPINHelp=The parameter is used for <a href="dongle_flashing.htm">user dongles flashing</a> and sets up the password for writing the root folder of the dongle. We strongly recommend to change the default value!
Device=Device
Direction=Direction
Directories=Directories
DLLExist=DLL "%s" already exist
DoFind=Find
DonglesFlashing=Dongles flashing
DonglesFlashingHelp=
Down=Down
DragFileToOpen=Drag a file here to open
Dump=Dump
DynamicOnlineCommands=Dynamic creation of online commands
Edit=Edit
EditDLL=Edit DLL
EditFolder=Edit folder
EditLicense=Edit license
EditProcedure=Edit procedure
EditWatermark=Edit watermark
EMail=E-Mail
EmptyCompile=There are no data for compilation
EmptyFileName=Name of a file is not specified
EmptyModule=Module is not specified
EmptyProcess=Process is not specified
EnabledForUse=Enabled for use
EncryptRegisters=Encrypt registers on exit of VM
EncryptRegistersHelp=If this option is enabled, the registers of the processor will contain encrypted values at VM output and these values will be decrypted in different places for each protected section of the code.
EraseUserKey=Erase user dongle
Error=Error
Execute=Execute
ExecutedFiles=Executable files
ExecutionCounter=Execution Counter
Exit=Exit
ExpertMode=Expert Mode
ExpireDate=Expiration Date
Export=Export
ExportKeyPair=Export Key Pair
ExtAddress=External address
ExternalAdresses=External addresses
Fast=Fast (fast unpacking)
File=File
FileCorrupted=File corrupted
FileInfo=File info
FileIsNotDLL=File "%s" is not x%d DLL
FileName=File name
FileOffset=File offset
FilePacked=Probably the file "%s" is packed.Do you want to open it anyway?
FileUnknownFormat=File "%s" has a unknown format
Find=Find
FindNext=Find next
Flags=Flags
FoundUnpairedMarkers=Found %d unpaired markers
Generate=Generate
Goto=Go to address
HardwareID=Hardware ID
HardwareIDInformation=Hardware Id Details
HDD=HDD
Header=Header
Help=Help
Hint=Hint
HomePage=Home page
Host=Host
Identifier=Identifier
Ignore=Ignore
Import=Import
ImportLicense=Import license
ImportLicenseFromProjectFile=Import licenses from project file
ImportLicenseFromSerialNumber=Import license from serial number
ImportLicenses=Import licenses from VMPDB file
ImportLicensesResult=Licenses imported: %dLicenses blocked: %d
ImportProtection=Import protection
ImportProtectionHelp=This option allows you to hide the list of APIs used by the protected program from the cracker.
IncludeInCompilation=Include in compilation
Information=Information
InvalidAddress=Invalid address
InvalidCPUType=Processor "%s" is not supported
InvalidFormat=File "%s" has an incorrect %s format
InvalidHardwareId=Hardware ID is invalid or empty
InvalidKeyID=Invalid key identifier
InvalidLicensingParameters=These licensing parameters don't match of the project
InvalidOSType=Operational system "%s" is not supported
InvalidSerialNumber=This serial number doesn't match of the project
JmpOnExternalAddress=Jump to the external address: %.8x
JmpOnInternalAddress=Jump to the internal address: %.8x
JumpOnCommandPart=Jump on a part of a command
Jumps=Jumps
Key=Key
KeyIdentifier=Dongle ID
KeyIdentifierHelp=This parameter may contain the dongle identifier that the particular copy of the protected application is bound to.
KeyLength=Key Length
KeyPairExportResult=Results of export
KeyPairExportTarget=Export format
KeyMode=Mode
KeyModeHelp=The parameter is used for <a href="dongle_flashing.htm">user dongles flashing</a> and sets up the dongle's executable modules format. The modules flashed to the dongle has to have the same format.
Language=Language
Legend=Legend
Level=Level
License=License
LicenseBlocked=License blocked
LicenseFiles=License Manager Database
Licenses=Licenses
LicenseInformation=License Details
LicenseNumber=License Number
LicenseOptions=Set following licensing options for all procedures
LicenseOptionsHelp=If this option is used, these licensing options will be applied to all objects included in the project with the "<a href="expert_procedures.htm#LockToKey">Lock to key</a>" option enabled.
LicenseDataNotFound=The license data not found in the file "%s"
LicenseFieldIsTooLong=Field "%s" is too long: %d bytes.Maximal number of bytes allowed: %d (in UTF-8 encoding)
LicensingParameters=Licensing parameters
LicensingParametersHelp=The software licensing system used to generation and validation of serial numbers. Various limitations are supported: date of expiration, running time limit, hardware lock, code encryption, limitation of free updates and <a href="manager/features.htm">much more</a>.
LicensingSystemHelp=In order to use the licensing system you need to generate a pair of keys. This pair will be used for serial number generation and checking.
LicensingSystemNotSupport=The licensing system not supported in this version
LoadAtStart=Load at start
Loading=Loading
LockToKey=Lock to dongle
LockToSerialNumber=Lock to serial number
LockToSerialNumberHelp=When this option is enabled, virtualized code is encrypted and can be executed only if the serial number is provided.
Mac=Ethernet
MarkerExist=Marker "%s" already exist
MAPFileHaveIncorrectTimeStamp=MAP file have incorrect timestamp and can not be loaded
MasterKeyPassword=Master dongle password
MasterKeyPasswordHelp=Use this field to specify which password VMProtect uses to access the master dongle containing the software protection module.
MatchCase=Match case
MaxBuildDate=Max Build Date
MaxProtection=Maximum protection
MaxSpeed=Maximum speed
MemoryProtection=Memory protection
MemoryProtectionHelp=This option allows protection of the file on disk and image in memory from any changes.
Messages=Messages
MinGateSize=Minimal size of procedure for compilation is 5 bytes
Module=Module
ModuleOpenError=Cannot open module "%s"
ModuleUnknownFormat=Module "%s" has a unknown format
MoveDown=Move down
MoveResourcesToEnd=Move resources to the end of file
MoveResourcesToEndHelp=If you use this option, the resource section will be moved to the end of the file.
MoveUp=Move up
Mutation=Mutation
Name=Name
NETNotSupported=NET applications are not supported
New=New
NewDLL=New DLL
NewFolder=New folder
NewLicense=New license
NewObjects=New markers and strings
NewProcedure=New procedure
Next=Next
No=No
NoConnection=No connection
NoPlaceForGate=There is no place for creation of an adapter
NoToAll=No to all
NotUseLicense=Do not use license
OK=OK
OnlineCommands=Online commands
Open=Open
OpenFile=Open file
OpenFolders=Expand all folders
OpenNewFile=Open new file
OptionAvialable=Option "%s" not avialable in unregistered version
Options=Options
OrderRef=Order #
Ordinal=Ordinal
Other=Other
OutputFile=Output file
OutputFileSize=Output file size %d bytes (%d%%)
Packing=Packing
PackOutputFile=Pack the output file
PackOutputFileHelp=This option enables packing of the protected file, which makes it smaller.
Parameters=Parameters
ParametersForMSVC=Parameters for KeyGen.dll (MSVC)
ParametersForDelphi=Parameters for KeyGen.dll (Delphi)
ParametersForNET=Parameters for KeyGen.Net/PayPro Global
ParametersForPHP=Parameters for keygen.php
Paste=Paste
PasteSerialNumber=Enter serial number
PeriodLimit=Period Limit
Pointer=address of
Procedure=Procedure
ProcedureNotFoundInMAP=Procedure "%s" is not found in objects list
ProceduresForProtect=Procedures for protection
Process=Process
ProductNotFound=Product with code "%s" is not found in the file "%s"
Project=Project
ProjectFile=Project file
ProjectFiles=Project files
PushOriginalAddress=Saving in a stack of the original address: %.8x
Redo=Redo
References=References
RegisteredTo=Registered to
RelativeAddress=Relative address
Reset=Reset
Resources=Resources
ResourceProtection=Resource protection
ResourceProtectionHelp=This option allows to encrypt resources, except icons, manifest and some other system types.
Retry=Retry
RunnerCRC=Check the integrity of VM objects
RunnerCRCHelp=This option allows you to silently check the integrity of all virtualized sections of the code and VM interpreters.
RunningTimeLimit=Running Time Limit
SaveLicensesAs=Save licenses as
SaveProject=Save project
SaveProjectAs=Save project as
Saving=Saving
Script=Script
ScriptFile=Script file
ScriptMessages=Script messages
Search=Search
SearchInFile=Search in file
SearchInProcess=Search in process
Section=Section
SectionNotPacked=Section "%s" can not be packed
SectionPosUsedByDir=Directory "%s" is in the field of creation of heading of new section
SectionPosUsedBySection=Section "%s" is in the field of creation of heading of new section
Sections=Sections
SEHNotSupported=Processing of exceptions is not supported: %.8x
SelectAll=Select all
SelectProceduresForProtect=Select procedures for protection
SerialNumber=Serial Number
SerialNumberInformation=Serial Number Content
SerialNumberDataIsTooLong=There is not enough space for data in the serial number.Maximal number of bytes allowed: %d, you used: %d
SerialNumberIsRequired=Serial number is required
Settings=Settings
Setup=Setup
ShellExt=Integrate into shell
ShowAll=Show all
ShowProtectedProcedures=Show protected procedures only
Size=Size
SortByName=To sort the list of procedures by name?
SortByType=To sort the list of procedures by compilation type?
StopCompilation=Do you really want to stop the compilation?
String=string
Strings=Strings
StringDeprecated=Use VMProtectDecryptStringA/VMProtectDecryptStringW to protect strings
StripFixups=Remove fixup elements (only for EXE files)
StripFixupsHelp=If the option is enabled, the section occupied by the list of fixup elements will be used for VM needs.
Text=Text
TextNotFound=Text "%s" not found
Thanks=Thanks
Toolbars=Toolbars
Tools=Tools
Type=Type
Ultra=Ultra (mutation + virtualization)
Unblock=Unblock Serial Number
Undo=Undo
Unregistered=Unregistered version
Up=Up
Usage=Usage
UseLicense=Use license
UseMAPFileOrMarkers=Use either <a href="use_markers.htm">markers</a> or <a href="use_map_file.htm">MAP files</a> to see your functions and code fragments
UseMasterKey=Use master dongle
UseOtherProject=Use other project file
UseProjectOptions=Use project options
UseProjectOptionsHelp=If this option is enabled, the current object will use the common <a href="expert_options.htm">protection options</a>. If this option is disabled, all individual <a href="expert_options.htm">protection options</a> can be selected for the current object.
UserAtr=Dongle ATR
UserAtrHelp=The parameter is used for <a href="dongle_flashing.htm">user dongles flashing</a> and sets up the user dongle ID.
UserData=User Data
UserDataIsTooLong=There is not enough space for data in the "User Data" field.Maximal number of bytes allowed: %d, you used: %d
UserKey=User Dongle
UserKeyHelp=A user dongle - the dongle that works on the end user side.
UserKeyUpdated=The user dongle has been successfully updated
UserPIN=User PIN
UserPINHelp=Use this field to specify which password the protected application uses to access the user dongle that is delivered to the end user together with the protected application.
Value=Value
ValuesFor=Values for
Variable=variable
Version=Version
VersionNumber=Version Number
View=View
Virtualization=Virtualization
VirtualMachines=Virtual Machines
VirtualMachinesHelp=Different VMs from those specified will be used to <a href="dictionary.htm#Virtualization">virtualize</a> different sections of the code.
VMSections=VM sections
VMSectionsHelp=Additional sections will be added to the file during compilation. Data will be written to these sections (virtualized code, mutated code, VM interpreters, watermarks, etc).
VMTools=Virtualization tools (VMware/Virtual PC/Sandboxie)
VMToolsHelp=This option prevents the protected file from being run in all kinds of virtual environments: VMware, Virtual PC, VirtualBox, Sandboxie.
VMToolsFound=Virtualization tools found
Warning=Warning
WatermarkCount=In unregistered version it is possible to create only one watermark
WatermarkDisabled=Watermark "%s" disabled for use
WatermarkExist=Watermark "%s" already exist
WatermarkName=Watermark name
WatermarkNotFound=Watermark "%s" is not found in watermark list
Watermarks=Watermarks
WatermarksHelp=Use the drop-down list to select the necessary <a href="dictionary.htm#Watermarks">watermark</a> in order to include it in the protected file.
WatermarkUsed=Watermark "%s" is used in protected files
Yes=Yes
YesToAll=Yes to all